import { IOrganization } from '../types/Organization';

export const organization: IOrganization[] = [
  {
    fullname: 'Организация ',
    shortname: 'орг1',
    inn: '1234567890',
    kpp: '0987654321',
    uchreditel: 'Иван Иванович Иванов',
    adresse: 'г. Красноярск, ул. Ленина, д. 1',
    phone: '+7 (393) 333-33-63',
    fillialas: [
      {
        address: 'г. Новосибирск, ул. Советская, д. 2',
        phone: '+7 (393) 111-11-51',
        boss: 'Петр Петрович Петров',
      },
      {
        address: 'г. Омск, ул. Ленина, д. 3',
        phone: '+7 (393) 222-22-22',
        boss: 'Сергей Сергеевич Сергеев',
      },
    ],
  },
  {
    fullname: 'Организация №2',
    shortname: 'орг1',
    inn: '1234567890',
    kpp: '0987654321',
    uchreditel: 'Иван Иванович Иванов',
    adresse: 'г. Красноярск, ул. Ленина, д. 1',
    phone: '+7 (393) 333-33-43',
    fillialas: [
      {
        address: 'г. Новосибирск, ул. Советская, д. 2',
        phone: '+7 (393) 111-11-11',
        boss: 'Петр Петрович Петров',
      },
      {
        address: 'г. Омск, ул. Ленина, д. 3',
        phone: '+7 (393) 222-22-22',
        boss: 'Сергей Сергеевич Сергеев',
      },
    ],
  },
  {
    fullname: 'Организация №1',
    shortname: 'орг1',
    inn: '1234567890',
    kpp: '0987654321',
    uchreditel: 'Иван Иванович Иванов',
    adresse: 'г. Красноярск, ул. Ленина, д. 1',
    phone: '+7 (393) 333-33-33',
    fillialas: [
      {
        address: 'г. Новосибирск, ул. Советская, д. 4',
        phone: '+7 (393) 111-11-11',
        boss: 'Петр Петрович Петров',
      },
      {
        address: 'г. Омск, ул. Ленина, д. 3',
        phone: '+7 (393) 222-22-22',
        boss: 'Сергей Сергеевич Сергеев',
      },
    ],
  },
];
